methods/ml-datasets.org
#+title: Reimaging: Dataset Research
#+author: Kynan Tan

* dataset research
** Indexes of datasets
*** Wiki list
https://en.wikipedia.org/wiki/List_of_datasets_for_machine_learning_research
*** Algorithmia Blog
https://blog.algorithmia.com/machine-learning-datasets-for-data-scientists/
lists some datasets
*** Hackernoon Machine Learning Process description
https://hackernoon.com/a-definitive-guide-to-build-training-data-for-computer-vision-1d1d50b4bf07
list some datasets and some tools for annotation and labelling (then becomes an advertisement)
*** Yet Another Computer Vision Index To Datasets (YACVID)
http://yacvid.hayko.at/
*** Deep Learning Datasets
http://deeplearning.net/datasets/
*** Open Data for Deep Learning
https://deeplearning4j.org/opendata
*** Computer Vision Online
https://computervisiononline.com/
*** CVonline Image Databases
http://homepages.inf.ed.ac.uk/rbf/CVonline/Imagedbase.htm
*** Awesome Computer Vision resources
https://github.com/jbhuang0604/awesome-computer-vision#datasets
*** mldata.org
http://mldata.org/repository/data/
*** Statistical Datasets
https://www.mat.univie.ac.at/~neum/statdat.html
*** Mulan Datasets
http://mulan.sourceforge.net/datasets-mlc.html
*** Medical Data for Machine Learning
https://github.com/beamandrew/medical-data
*** UC Irvine datasets
http://archive.ics.uci.edu/ml/index.php
*** Mighty AI
https://mty.ai/blog/training-data-for-computer-vision-algorithms-your-options-for-collecting-or-creating-annotated-datasets/
*** Pew Research Center
http://www.pewresearch.org/download-datasets/
*** Open Data Network
https://www.opendatanetwork.com/
*** Open Data Stack Exchange
https://opendata.stackexchange.com/
*** Data Is Plural - Structured Archive
https://docs.google.com/spreadsheets/d/1wZhPLMCHKJvwOkP4juclhjFgqIY8fQFMemwKL2c64vk/edit#gid=0
*** Kaggle databases
Kaggle hosts machine learning competitions as well as datasets and learning materials for data science and machine learning.

https://www.kaggle.com/datasets

Huge range of datasets, ordered by popularity. Used extensively for testing and learning about data science. Some datasets are duplicates that are hosted elsewhere and mirrored by Kaggle.
** ImageNet
http://image-net.org
*** browse image classes through search/filters
http://image-net.org/challenges/LSVRC/2015/ui/det.html
