ml-datasets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-15 Tue 11:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reimaging: Dataset Research</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kynan Tan" />
</head>
<body>
<div id="content">
<h1 class="title">Reimaging: Dataset Research</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2b2c6c0">1. dataset research</a>
<ul>
<li><a href="#org41b2a01">1.1. Indexes of datasets</a>
<ul>
<li><a href="#org7333e47">1.1.1. Wiki list</a></li>
<li><a href="#org642e5da">1.1.2. Algorithmia Blog</a></li>
<li><a href="#org93fdf18">1.1.3. Hackernoon Machine Learning Process description</a></li>
<li><a href="#org2967d4e">1.1.4. Yet Another Computer Vision Index To Datasets (YACVID)</a></li>
<li><a href="#org15e53ef">1.1.5. Deep Learning Datasets</a></li>
<li><a href="#org276426c">1.1.6. Open Data for Deep Learning</a></li>
<li><a href="#orgf584679">1.1.7. Computer Vision Online</a></li>
<li><a href="#org3ad586c">1.1.8. CVonline Image Databases</a></li>
<li><a href="#org8835e27">1.1.9. Awesome Computer Vision resources</a></li>
<li><a href="#orge624e8f">1.1.10. mldata.org</a></li>
<li><a href="#org993f439">1.1.11. Statistical Datasets</a></li>
<li><a href="#orgbe4b324">1.1.12. Mulan Datasets</a></li>
<li><a href="#org0e50a6b">1.1.13. Medical Data for Machine Learning</a></li>
<li><a href="#org1e04f71">1.1.14. UC Irvine datasets</a></li>
<li><a href="#org08f7d08">1.1.15. Mighty AI</a></li>
<li><a href="#orgb774a07">1.1.16. Pew Research Center</a></li>
<li><a href="#org9575239">1.1.17. Open Data Network</a></li>
<li><a href="#orge496483">1.1.18. Open Data Stack Exchange</a></li>
<li><a href="#orgcc001e4">1.1.19. Data Is Plural - Structured Archive</a></li>
<li><a href="#org9957179">1.1.20. Kaggle databases</a></li>
</ul>
</li>
<li><a href="#orge175977">1.2. ImageNet</a>
<ul>
<li><a href="#orge63a3bb">1.2.1. browse image classes through search/filters</a></li>
<li><a href="#org351d3ab">1.2.2. description</a></li>
</ul>
</li>
<li><a href="#org56c6ffb">1.3. CIFAR-10 and CIFAR-100</a></li>
<li><a href="#org3e01d6f">1.4. MNIST</a></li>
<li><a href="#org8ffb7de">1.5. Common Objects in Context (COCO)</a></li>
<li><a href="#org6e6251b">1.6. Google Open Image</a></li>
<li><a href="#org6209ca7">1.7. Google YouTube8M</a></li>
<li><a href="#orga81fa31">1.8. CMU Face Images Data Set</a></li>
<li><a href="#orgf21d2e7">1.9. 11k hands</a></li>
<li><a href="#orgc549db2">1.10. STL-10</a></li>
<li><a href="#org3e1c63a">1.11. MIAS</a></li>
<li><a href="#orgc98a68d">1.12. Danbooru2017</a></li>
<li><a href="#org2508e7b">1.13. NutriNet</a></li>
<li><a href="#orgb6abc48">1.14. Caltech 101 / 256 / Silhouettes</a></li>
<li><a href="#orgdf8063d">1.15. Visual Dictionary</a></li>
<li><a href="#org552339b">1.16. Behance Artistic Media Dataset</a></li>
<li><a href="#orgfd48b46">1.17. stanford dogs dataset</a></li>
<li><a href="#org27aff1b">1.18. Comma.ai driving dataset</a></li>
<li><a href="#org2bd99f9">1.19. cat database</a></li>
<li><a href="#org4e3db57">1.20. Cityscapes Dataset</a></li>
<li><a href="#org473769b">1.21. links to check</a></li>
<li><a href="#org1309eb5">1.22. openfMRI</a></li>
<li><a href="#org8ce39f0">1.23. List of medical databases</a></li>
<li><a href="#org9d3a77c">1.24. simpsons image training dataset</a></li>
<li><a href="#orgbc12071">1.25. natural earth</a></li>
<li><a href="#org4d5db44">1.26. Google Trends Datastore</a></li>
<li><a href="#org2537f18">1.27. USGS.gov</a></li>
<li><a href="#org0c2f7f8">1.28. Overhead Imagery Research Data Set</a></li>
<li><a href="#org470b32a">1.29. Image segmentation data set</a></li>
<li><a href="#org2250681">1.30. MovieLens</a></li>
<li><a href="#orgd313f07">1.31. spam assasin</a></li>
<li><a href="#org6306de5">1.32. fashion mnist</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2b2c6c0" class="outline-2">
<h2 id="org2b2c6c0"><span class="section-number-2">1</span> dataset research</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org41b2a01" class="outline-3">
<h3 id="org41b2a01"><span class="section-number-3">1.1</span> Indexes of datasets</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-org7333e47" class="outline-4">
<h4 id="org7333e47"><span class="section-number-4">1.1.1</span> Wiki list</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<a href="https://en.wikipedia.org/wiki/List_of_datasets_for_machine_learning_research">https://en.wikipedia.org/wiki/List_of_datasets_for_machine_learning_research</a>
</p>
</div>
</div>
<div id="outline-container-org642e5da" class="outline-4">
<h4 id="org642e5da"><span class="section-number-4">1.1.2</span> Algorithmia Blog</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<a href="https://blog.algorithmia.com/machine-learning-datasets-for-data-scientists/">https://blog.algorithmia.com/machine-learning-datasets-for-data-scientists/</a>
lists some datasets
</p>
</div>
</div>
<div id="outline-container-org93fdf18" class="outline-4">
<h4 id="org93fdf18"><span class="section-number-4">1.1.3</span> Hackernoon Machine Learning Process description</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<a href="https://hackernoon.com/a-definitive-guide-to-build-training-data-for-computer-vision-1d1d50b4bf07">https://hackernoon.com/a-definitive-guide-to-build-training-data-for-computer-vision-1d1d50b4bf07</a>
list some datasets and some tools for annotation and labelling (then becomes an advertisement)
</p>
</div>
</div>
<div id="outline-container-org2967d4e" class="outline-4">
<h4 id="org2967d4e"><span class="section-number-4">1.1.4</span> Yet Another Computer Vision Index To Datasets (YACVID)</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
<a href="http://yacvid.hayko.at/">http://yacvid.hayko.at/</a>
</p>
</div>
</div>
<div id="outline-container-org15e53ef" class="outline-4">
<h4 id="org15e53ef"><span class="section-number-4">1.1.5</span> Deep Learning Datasets</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
<a href="http://deeplearning.net/datasets/">http://deeplearning.net/datasets/</a>
</p>
</div>
</div>
<div id="outline-container-org276426c" class="outline-4">
<h4 id="org276426c"><span class="section-number-4">1.1.6</span> Open Data for Deep Learning</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
<a href="https://deeplearning4j.org/opendata">https://deeplearning4j.org/opendata</a>
</p>
</div>
</div>
<div id="outline-container-orgf584679" class="outline-4">
<h4 id="orgf584679"><span class="section-number-4">1.1.7</span> Computer Vision Online</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
<a href="https://computervisiononline.com/">https://computervisiononline.com/</a>
</p>
</div>
</div>
<div id="outline-container-org3ad586c" class="outline-4">
<h4 id="org3ad586c"><span class="section-number-4">1.1.8</span> CVonline Image Databases</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
<a href="http://homepages.inf.ed.ac.uk/rbf/CVonline/Imagedbase.htm">http://homepages.inf.ed.ac.uk/rbf/CVonline/Imagedbase.htm</a>
</p>
</div>
</div>
<div id="outline-container-org8835e27" class="outline-4">
<h4 id="org8835e27"><span class="section-number-4">1.1.9</span> Awesome Computer Vision resources</h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
<a href="https://github.com/jbhuang0604/awesome-computer-vision#datasets">https://github.com/jbhuang0604/awesome-computer-vision#datasets</a>
</p>
</div>
</div>
<div id="outline-container-orge624e8f" class="outline-4">
<h4 id="orge624e8f"><span class="section-number-4">1.1.10</span> mldata.org</h4>
<div class="outline-text-4" id="text-1-1-10">
<p>
<a href="http://mldata.org/repository/data/">http://mldata.org/repository/data/</a>
</p>
</div>
</div>
<div id="outline-container-org993f439" class="outline-4">
<h4 id="org993f439"><span class="section-number-4">1.1.11</span> Statistical Datasets</h4>
<div class="outline-text-4" id="text-1-1-11">
<p>
<a href="https://www.mat.univie.ac.at/~neum/statdat.html">https://www.mat.univie.ac.at/~neum/statdat.html</a>
</p>
</div>
</div>
<div id="outline-container-orgbe4b324" class="outline-4">
<h4 id="orgbe4b324"><span class="section-number-4">1.1.12</span> Mulan Datasets</h4>
<div class="outline-text-4" id="text-1-1-12">
<p>
<a href="http://mulan.sourceforge.net/datasets-mlc.html">http://mulan.sourceforge.net/datasets-mlc.html</a>
</p>
</div>
</div>
<div id="outline-container-org0e50a6b" class="outline-4">
<h4 id="org0e50a6b"><span class="section-number-4">1.1.13</span> Medical Data for Machine Learning</h4>
<div class="outline-text-4" id="text-1-1-13">
<p>
<a href="https://github.com/beamandrew/medical-data">https://github.com/beamandrew/medical-data</a>
</p>
</div>
</div>
<div id="outline-container-org1e04f71" class="outline-4">
<h4 id="org1e04f71"><span class="section-number-4">1.1.14</span> UC Irvine datasets</h4>
<div class="outline-text-4" id="text-1-1-14">
<p>
<a href="http://archive.ics.uci.edu/ml/index.php">http://archive.ics.uci.edu/ml/index.php</a>
</p>
</div>
</div>
<div id="outline-container-org08f7d08" class="outline-4">
<h4 id="org08f7d08"><span class="section-number-4">1.1.15</span> Mighty AI</h4>
<div class="outline-text-4" id="text-1-1-15">
<p>
<a href="https://mty.ai/blog/training-data-for-computer-vision-algorithms-your-options-for-collecting-or-creating-annotated-datasets/">https://mty.ai/blog/training-data-for-computer-vision-algorithms-your-options-for-collecting-or-creating-annotated-datasets/</a>
</p>
</div>
</div>
<div id="outline-container-orgb774a07" class="outline-4">
<h4 id="orgb774a07"><span class="section-number-4">1.1.16</span> Pew Research Center</h4>
<div class="outline-text-4" id="text-1-1-16">
<p>
<a href="http://www.pewresearch.org/download-datasets/">http://www.pewresearch.org/download-datasets/</a>
</p>
</div>
</div>
<div id="outline-container-org9575239" class="outline-4">
<h4 id="org9575239"><span class="section-number-4">1.1.17</span> Open Data Network</h4>
<div class="outline-text-4" id="text-1-1-17">
<p>
<a href="https://www.opendatanetwork.com/">https://www.opendatanetwork.com/</a>
</p>
</div>
</div>
<div id="outline-container-orge496483" class="outline-4">
<h4 id="orge496483"><span class="section-number-4">1.1.18</span> Open Data Stack Exchange</h4>
<div class="outline-text-4" id="text-1-1-18">
<p>
<a href="https://opendata.stackexchange.com/">https://opendata.stackexchange.com/</a>
</p>
</div>
</div>
<div id="outline-container-orgcc001e4" class="outline-4">
<h4 id="orgcc001e4"><span class="section-number-4">1.1.19</span> Data Is Plural - Structured Archive</h4>
<div class="outline-text-4" id="text-1-1-19">
<p>
<a href="https://docs.google.com/spreadsheets/d/1wZhPLMCHKJvwOkP4juclhjFgqIY8fQFMemwKL2c64vk/edit#gid=0">https://docs.google.com/spreadsheets/d/1wZhPLMCHKJvwOkP4juclhjFgqIY8fQFMemwKL2c64vk/edit#gid=0</a>
</p>
</div>
</div>
<div id="outline-container-org9957179" class="outline-4">
<h4 id="org9957179"><span class="section-number-4">1.1.20</span> Kaggle databases</h4>
<div class="outline-text-4" id="text-1-1-20">
<p>
Kaggle hosts machine learning competitions as well as datasets and learning materials for data science and machine learning.
</p>

<p>
<a href="https://www.kaggle.com/datasets">https://www.kaggle.com/datasets</a>
</p>

<p>
Huge range of datasets, ordered by popularity. Used extensively for testing and learning about data science. Some datasets are duplicates that are hosted elsewhere and mirrored by Kaggle.
</p>
</div>
</div>
</div>
<div id="outline-container-orge175977" class="outline-3">
<h3 id="orge175977"><span class="section-number-3">1.2</span> ImageNet</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="http://image-net.org">http://image-net.org</a>
</p>
</div>
<div id="outline-container-orge63a3bb" class="outline-4">
<h4 id="orge63a3bb"><span class="section-number-4">1.2.1</span> browse image classes through search/filters</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<a href="http://image-net.org/challenges/LSVRC/2015/ui/det.html">http://image-net.org/challenges/LSVRC/2015/ui/det.html</a>
</p>
</div>
</div>
