ml-datasets.html
<div id="outline-container-org351d3ab" class="outline-4">
<h4 id="org351d3ab"><span class="section-number-4">1.2.2</span> description</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Overview
</p>

<p>
Welcome to the ImageNet project! ImageNet is an ongoing research effort to provide researchers around the world an easily accessible image database. On this page, you will find some useful information about the database, the ImageNet community, and the background of this project. Please feel free to contact us if you have comments or questions. We'd love to hear from researchers on ideas to improve ImageNet.
</p>

<p>
What is ImageNet?
</p>

<p>
ImageNet is an image dataset organized according to the WordNet hierarchy. Each meaningful concept in WordNet, possibly described by multiple words or word phrases, is called a "synonym set" or "synset". There are more than 100,000 synsets in WordNet, majority of them are nouns (80,000+). In ImageNet, we aim to provide on average 1000 images to illustrate each synset. Images of each concept are quality-controlled and human-annotated. In its completion, we hope ImageNet will offer tens of millions of cleanly sorted images for most of the concepts in the WordNet hierarchy.
</p>

<p>
Why ImageNet?
</p>

<p>
The ImageNet project is inspired by a growing sentiment in the image and vision research field  the need for more data. Ever since the birth of the digital era and the availability of web-scale data exchanges, researchers in these fields have been working hard to design more and more sophisticated algorithms to index, retrieve, organize and annotate multimedia data. But good research needs good resource. To tackle these problem in large-scale (think of your growing personal collection of digital images, or videos, or a commercial web search engines database), it would be tremendously helpful to researchers if there exists a large-scale image database. This is the motivation for us to put together ImageNet. We hope it will become a useful resource to our research community, as well as anyone whose research and education would benefit from using a large image database.
</p>

<p>
Who uses ImageNet?
</p>

<p>
We envision ImageNet as a useful resource to researchers in the academic world, as well as educators around the world.
</p>

<p>
Does ImageNet own the images? Can I download the images?
</p>

<p>
No, ImageNet does not own the copyright of the images. ImageNet only provides thumbnails and URLs of images, in a way similar to what image search engines do. In other words, ImageNet compiles an accurate list of web images for each synset of WordNet. For researchers and educators who wish to use the images for non-commercial research and/or educational purposes, we can provide access through our site under certain conditions and terms. For details click here
</p>
</div>
</div>
</div>

<div id="outline-container-org56c6ffb" class="outline-3">
<h3 id="org56c6ffb"><span class="section-number-3">1.3</span> CIFAR-10 and CIFAR-100</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="http://www.cs.toronto.edu/~kriz/cifar.html">http://www.cs.toronto.edu/~kriz/cifar.html</a>
The CIFAR-10 and CIFAR-100 are labeled subsets of the 80 million tiny images dataset. They were collected by Alex Krizhevsky, Vinod Nair, and Geoffrey Hinton. 
</p>

<p>
The CIFAR-10 dataset
The CIFAR-10 dataset consists of 60000 32x32 colour images in 10 classes, with 6000 images per class. There are 50000 training images and 10000 test images.
</p>

<p>
The dataset is divided into five training batches and one test batch, each with 10000 images. The test batch contains exactly 1000 randomly-selected images from each class. The training batches contain the remaining images in random order, but some training batches may contain more images from one class than another. Between them, the training batches contain exactly 5000 images from each class. 
</p>

<p>
The CIFAR-100 dataset
This dataset is just like the CIFAR-10, except it has 100 classes containing 600 images each. There are 500 training images and 100 testing images per class. The 100 classes in the CIFAR-100 are grouped into 20 superclasses. Each image comes with a "fine" label (the class to which it belongs) and a "coarse" label (the superclass to which it belongs).
Here is the list of classes in the CIFAR-100:
</p>
</div>
</div>
<div id="outline-container-org3e01d6f" class="outline-3">
<h3 id="org3e01d6f"><span class="section-number-3">1.4</span> MNIST</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="http://yann.lecun.com/exdb/mnist/">http://yann.lecun.com/exdb/mnist/</a>
The MNIST database of handwritten digits, available from this page, has a training set of 60,000 examples, and a test set of 10,000 examples. It is a subset of a larger set available from NIST. The digits have been size-normalized and centered in a fixed-size image. 
</p>

<p>
The original black and white (bilevel) images from NIST were size normalized to fit in a 20x20 pixel box while preserving their aspect ratio. The resulting images contain grey levels as a result of the anti-aliasing technique used by the normalization algorithm. the images were centered in a 28x28 image by computing the center of mass of the pixels, and translating the image so as to position this point at the center of the 28x28 field. 
</p>
</div>
</div>
<div id="outline-container-org8ffb7de" class="outline-3">
<h3 id="org8ffb7de"><span class="section-number-3">1.5</span> Common Objects in Context (COCO)</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="http://cocodataset.org/#home">http://cocodataset.org/#home</a>
</p>

<p>
COCO is a large-scale object detection, segmentation, and captioning dataset. COCO has several features:
</p>

<ul class="org-ul">
<li>Object segmentation</li>
<li>Recognition in context</li>
<li>Superpixel stuff segmentation</li>
<li>330K images (&gt;200K labeled)</li>
<li>1.5 million object instances</li>
<li>80 object categories</li>
<li>91 stuff categories</li>
<li>5 captions per image</li>
<li>250,000 people with keypoints</li>
</ul>

<p>
Images labelled with particular objects identified by rectangles or outlines
</p>
</div>
</div>
<div id="outline-container-org6e6251b" class="outline-3">
<h3 id="org6e6251b"><span class="section-number-3">1.6</span> Google Open Image</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<a href="https://github.com/openimages/dataset">https://github.com/openimages/dataset</a>
Open Images is a dataset of ~9 million URLs to images that have been annotated with image-level labels and bounding boxes spanning thousands of classes.
</p>

<p>
The annotations are licensed by Google Inc. under CC BY 4.0 license. The contents of this repository are released under an Apache 2 license.
</p>

<p>
The images are listed as having a CC BY 2.0 license. Note: while we tried to identify images that are licensed under a Creative Commons Attribution license, we make no representations or warranties regarding the license status of each image and you should verify the license for each image yourself.
</p>

<p>
1.76 million image files
~18TB of image files
990MB of annnotations and metadata
labelled images with bounding boxes for particular object classifications
</p>

<p>
Can be downloaded following instructions here: <a href="https://github.com/cvdfoundation/open-images-dataset">https://github.com/cvdfoundation/open-images-dataset</a>
</p>
</div>
</div>
