ml-datasets.html
<div id="outline-container-org6209ca7" class="outline-3">
<h3 id="org6209ca7"><span class="section-number-3">1.7</span> Google YouTube8M</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<a href="https://research.google.com/youtube8m/">https://research.google.com/youtube8m/</a>
YouTube-8M is a large-scale labeled video dataset that consists of millions of YouTube video IDs and associated labels from a diverse vocabulary of 4700+ visual entities. It comes with precomputed state-of-the-art audio-visual features from billions of frames and audio segments, designed to fit on a single hard disk. This makes it possible to get started on this dataset by training a baseline video model in less than a day on a single machine! At the same time, the dataset's scale and diversity can enable deep exploration of complex audio-visual models that can take weeks to train even in a distributed fashion.
</p>

<p>
Our goal is to accelerate research on large-scale video understanding, representation learning, noisy data modeling, transfer learning, and domain adaptation approaches for video. More details about the dataset and initial experiments can be found in our technical report. Some statistics from the latest version of the dataset are included below. 
</p>

<p>
<a href="https://research.google.com/youtube8m/download.html">https://research.google.com/youtube8m/download.html</a>
</p>

<p>
Download as TensorFlow record files.
Creative Commons Attribution 4.0 International (CC BY 4.0) licence.
</p>
</div>
</div>
<div id="outline-container-orga81fa31" class="outline-3">
<h3 id="orga81fa31"><span class="section-number-3">1.8</span> CMU Face Images Data Set</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<a href="http://archive.ics.uci.edu/ml/datasets/cmu+face+images">http://archive.ics.uci.edu/ml/datasets/cmu+face+images</a>
Abstract: This data consists of 640 black and white face images of people taken with varying pose (straight, left, right, up), expression (neutral, happy, sad, angry), eyes (wearing sunglasses or not), and size
</p>
</div>
</div>
<div id="outline-container-orgf21d2e7" class="outline-3">
<h3 id="orgf21d2e7"><span class="section-number-3">1.9</span> 11k hands</h3>
<div class="outline-text-3" id="text-1-9">
<p>
<a href="https://sites.google.com/view/11khands">https://sites.google.com/view/11khands</a>
</p>
</div>
</div>
<div id="outline-container-orgc549db2" class="outline-3">
<h3 id="orgc549db2"><span class="section-number-3">1.10</span> STL-10</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Subset of ImageNet selected for unsupervised feature learning, deep learning and self-taught learning algorithms. Similar to CIFAR-10
</p>

<p>
<a href="https://cs.stanford.edu/~acoates/stl10/">https://cs.stanford.edu/~acoates/stl10/</a>
The STL-10 dataset is an image recognition dataset for developing unsupervised feature learning, deep learning, self-taught learning algorithms. It is inspired by the CIFAR-10 dataset but with some modifications. In particular, each class has fewer labeled training examples than in CIFAR-10, but a very large set of unlabeled examples is provided to learn image models prior to supervised training. The primary challenge is to make use of the unlabeled data (which comes from a similar but different distribution from the labeled data) to build a useful prior. We also expect that the higher resolution of this dataset (96x96) will make it a challenging benchmark for developing more scalable unsupervised learning methods.
Overview
</p>

<ul class="org-ul">
<li>10 classes: airplane, bird, car, cat, deer, dog, horse, monkey, ship, truck.</li>
<li>Images are 96x96 pixels, color.</li>
<li>500 training images (10 pre-defined folds), 800 test images per class.</li>
<li>100000 unlabeled images for unsupervised learning. These examples are extracted from a similar but broader distribution of images. For instance, it contains other types of animals (bears, rabbits, etc.) and vehicles (trains, buses, etc.) in addition to the ones in the labeled set.</li>
<li>Images were acquired from labeled examples on ImageNet.</li>
</ul>
</div>
</div>

<div id="outline-container-org3e1c63a" class="outline-3">
<h3 id="org3e1c63a"><span class="section-number-3">1.11</span> MIAS</h3>
<div class="outline-text-3" id="text-1-11">
<p>
<a href="http://www.mammoimage.org/databases/">http://www.mammoimage.org/databases/</a>
Mammographic Image Analysis Society
</p>
</div>
</div>
<div id="outline-container-orgc98a68d" class="outline-3">
<h3 id="orgc98a68d"><span class="section-number-3">1.12</span> Danbooru2017</h3>
<div class="outline-text-3" id="text-1-12">
<p>
<a href="https://www.gwern.net/Danbooru2017">https://www.gwern.net/Danbooru2017</a>
Danbooru2017 is a large-scale anime image database with 2.9m+ images annotated with 77.5m+ tags; it can be useful for machine learning purposes such as image recognition and generation. (statistics, NN, anime, shell)
</p>
</div>
</div>
<div id="outline-container-org2508e7b" class="outline-3">
<h3 id="org2508e7b"><span class="section-number-3">1.13</span> NutriNet</h3>
<div class="outline-text-3" id="text-1-13">
<p>
<a href="https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5537777/">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5537777/</a>
</p>

<p>
Paper Abstract:
Automatic food image recognition systems are alleviating the process of food-intake estimation and dietary assessment. However, due to the nature of food images, their recognition is a particularly challenging task, which is why traditional approaches in the field have achieved a low classification accuracy. Deep neural networks have outperformed such solutions, and we present a novel approach to the problem of food and drink image detection and recognition that uses a newly-defined deep convolutional neural network architecture, called NutriNet. This architecture was tuned on a recognition dataset containing 225,953 512 512 pixel images of 520 different food and drink items from a broad spectrum of food groups, on which we achieved a classification accuracy of 86.72%, along with an accuracy of 94.47% on a detection dataset containing 130,517 images. We also performed a real-world test on a dataset of self-acquired images, combined with images from Parkinsons disease patients, all taken using a smartphone camera, achieving a top-five accuracy of 55%, which is an encouraging result for real-world images. Additionally, we tested NutriNet on the University of Milano-Bicocca 2016 (UNIMIB2016) food image dataset, on which we improved upon the provided baseline recognition result. An online training component was implemented to continually fine-tune the food and drink recognition model on new images. The model is being used in practice as part of a mobile app for the dietary assessment of Parkinsons disease patients.
</p>
</div>
</div>

<div id="outline-container-orgb6abc48" class="outline-3">
<h3 id="orgb6abc48"><span class="section-number-3">1.14</span> Caltech 101 / 256 / Silhouettes</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li>101 (circa. 2003)</li>
</ul>
<p>
Description
</p>

<p>
Pictures of objects belonging to 101 categories. About 40 to 800 images per category. Most categories have about 50 images. Collected in September 2003 by Fei-Fei Li, Marco Andreetto, and Marc 'Aurelio Ranzato.  The size of each image is roughly 300 x 200 pixels.
We have carefully clicked outlines of each object in these pictures, these are included under the 'Annotations.tar'. There is also a matlab script to view the annotaitons, 'show<sub>annotations.m</sub>'.
How to use the dataset
</p>

<p>
If you are using the Caltech 101 dataset for testing your recognition algorithm you should try and make your results comparable to the results of others. We suggest training and testing on fixed number of pictures and repeating the experiment with different random selections of pictures in order to obtain error bars. Popular number of training images: 1, 3, 5, 10, 15, 20, 30. Popular numbers of testing images: 20, 30. See also the discussion below.
When you report your results please keep track of which images you used and which were misclassified. We will soon publish a more detailed experimental protocol that allows you to report those details. See the Discussion section for more details.
</p>

<p>
-256 (circa. 2006)
Collection of all 30607 images
256 Object Categories + Clutter
At least 80 images per category
</p>
</div>
</div>

<div id="outline-container-orgdf8063d" class="outline-3">
<h3 id="orgdf8063d"><span class="section-number-3">1.15</span> Visual Dictionary</h3>
<div class="outline-text-3" id="text-1-15">
<p>
<a href="http://groups.csail.mit.edu/vision/TinyImages/">http://groups.csail.mit.edu/vision/TinyImages/</a>
80 million tiny images
</p>

<p>
This is the dataset which CIFAR is taken from.
</p>

<p>
<a href="http://horatio.cs.nyu.edu/mit/tiny/data/index.html">http://horatio.cs.nyu.edu/mit/tiny/data/index.html</a>
</p>
</div>
</div>
