methods/ml-datasets.org
** Behance Artistic Media Dataset
https://bam-dataset.org/#download
2.5 million images
automatically labelled
-  Automatically-labeled binary attribute scores for over 2.5 million images across 20 attributes each
- 393,000 crowdsourced binary attribute labels for individual images
- Short image descriptions/captions for 74,000 images from the crowd
- Image URLs for all images mentioned above
** stanford dogs dataset
http://vision.stanford.edu/aditya86/ImageNetDogs/
** Comma.ai driving dataset
https://archive.org/details/comma-dataset
** cat database
https://www.reddit.com/r/MachineLearning/comments/16rxn0/ml_for_reddit_10000_images_of_cats/ (sorry about reddit link, beware of cat puns)

Link to torrent file.

10,000 images of cats.
** Cityscapes Dataset
https://www.cityscapes-dataset.com/dataset-overview/
** links to check
https://www.visualdata.io/
** openfMRI
https://openfmri.org
** List of medical databases
You are welcome: here are some more name of medical database:
2008 MICCAI MS Lesion Segmentation Challenge (National Institutes of Health Blueprint for Neuroscience Research)
ASU DR-AutoCC Data - a Multiple-Instance Learning feature space for a diabetic retinopathy classification dataset (Ragav Venkatesan, Parag Chandakkar, Baoxin Li - Arizona State University)
Aberystwyth Leaf Evaluation Dataset - Timelapse plant images with hand marked up leaf-level segmentations for some time steps, and biological data from plant sacrifice. (Bell, Jonathan; Dee, Hannah M.)
Annotated Spine CT Database for Benchmarking of Vertebrae Localization, 125 patients, 242 scans (Ben Glockern)
BRATS - the identification and segmentation of tumor structures in multiparametric magnetic resonance images of the brain (TU Munchen etc.)
Cholec80: 80 gallbladder laparoscopic videos annotated with phase and tool information. (Andru Putra Twinanda)
CRCHistoPhenotypes - Labeled Cell Nuclei Data - colorectal cancer?histology images?consisting of nearly 30,000 dotted nuclei with over 22,000 labeled with the cell type (Rajpoot + Sirinukunwattana)
CREMI: MICCAI 2016 Challenge - 6 volumes of electron microscopy of neural tissue,neuron and synapse segmentation, synaptic partner annotation. (Jan Funke, Stephan Saalfeld, Srini Turaga, Davi Bock, Eric Perlman)
Cavy Action Dataset - 16 sequences with 640 x 480 resolutions recorded at 7.5 frames per second (fps) with approximately 31621506 frames in total (272 GB) of interacting cavies (guinea pig) (Al-Raziqi and Denzler)
Cell Tracking Challenge Datasets - 2D/3D time-lapse video sequences with ground truth(Ma et al., Bioinformatics 30:1609-1617, 2014)
Computed Tomography Emphysema Database (Lauge Sorensen)
CRIM13 Caltech Resident-Intruder Mouse dataset - 237 10 minute videos (25 fps)
annotated with actions (13 classes) (Burgos-Artizzu, Dollr, Lin, Anderson and Perona)
DIADEM: Digital Reconstruction of Axonal and Dendritic Morphology Competition (Allen Institute for Brain Science et al)
DIARETDB1 - Standard Diabetic Retinopathy Database (Lappeenranta Univ of Technology)
DRIVE: Digital Retinal Images for Vessel Extraction (Univ of Utrecht)
DeformIt 2.0 - Image Data Augmentation Tool: Simulate novel images with ground truth segmentations from a single image-segmentation pair (Brian Booth and Ghassan Hamarneh)
Deformable Image Registration Lab dataset - for objective and rigrorous evaluation of deformable image registration (DIR) spatial accuracy performance. (Richard Castillo et al.)
Dermoscopy images (Eric Ehrsam)
EPT29.This database contains 4842 images of 1613 specimens of 29 taxa of EPTs:(Tom etc.)
FIRE Fundus Image Registration Dataset - 134 retinal image pairs and groud truth for registration.(FORTH-ICS)
IRMA(Image retrieval in medical applications) - This collection compiles anonymous radiographs (Deserno TM, Ott B)
KID - A capsule endoscopy database for medical decision support (Anastasios Koulaouzidis and Dimitris Iakovidis)
Leaf Segmentation ChallengeTobacco and arabidopsis plant images (Hanno Scharr, Massimo Minervini, Andreas Fischbach, Sotirios A. Tsaftaris)
MIT CBCL Automated Mouse Behavior Recognition datasets (Nicholas Edelman)
MUCIC: Masaryk University Cell Image Collection - 2D/3D synthetic images of cells/tissues for benchmarking(Masaryk University)
MiniMammographic Database (Mammographic Image Analysis Society)
Moth fine-grained recognition - 675 similar classes, 5344 images (Erik Rodner et al)
Mouse Embryo Tracking Database - cell division event detection (Marcelo Cicconet, Kris Gunsalus)
OASIS - Open Access Series of Imaging Studies - 500+ MRI data sets of the brain (Washington University, Harvard University, Biomedical Informatics Research Network)
Plant Phenotyping Datasets - plant data suitable for plant and leaf detection, segmentation, tracking, and species recognition (M. Minervini, A. Fischbach, H. Scharr, S. A. Tsaftaris)
RatSI: Rat Social Interaction Dataset - 9 fully annotated (11 class) videos (15 minute, 25 FPS) of two rats interacting socially in a cage (Malte Lorbach, Noldus Information Technology)
Retinal fundus images - Ground truth of vascular bifurcations and crossovers (Univ of Groningen)
SCORHE - 1, 2 and 3 mouse behavior videos, 9 behaviors, (Ghadi H. Salem, et al, NIH)
STructured Analysis of the Retina - DESCRIPTION(400+ retinal images, with ground truth segmentations and medical annotations)
Spine and Cardiac data (Digital Imaging Group of London Ontario, Shuo Li)
Stonefly9This database contains 3826 images of 773 specimens of 9 taxa of Stoneflies (Tom etc.)
Synthetic Migrating Cells -Six artificial migrating cells (neutrophils) over 98 time frames, various levels of Gaussian/Poisson noise and different paths characteristics with ground truth. (Dr Constantino Carlos Reyes-Aldasoro et al.)
Univ of Central Florida - DDSM: Digital Database for Screening Mammography (Univ of Central Florida)
VascuSynth - 120 3D vascular tree like structures with ground truth (Mengliu Zhao, Ghassan Hamarneh)
VascuSynth - Vascular Synthesizer generates vascular trees in 3D volumes. (Ghassan Hamarneh, Preet Jassi, Mengliu Zhao)
York Cardiac MRI dataset (Alexander Andreopoulos)
** simpsons image training dataset
https://github.com/jbencina/simpsons-image-training-dataset
** natural earth
http://www.naturalearthdata.com/
Free vector and raster map data at 1:10m, 1:50m, and 1:110m scales
** Google Trends Datastore
http://googletrends.github.io/data/
** USGS.gov
https://www.usgs.gov/products/data-and-tools/overview
