methods/ml-datasets.org
** Overhead Imagery Research Data Set
https://en.wikipedia.org/wiki/Overhead_Imagery_Research_Data_Set
** Image segmentation data set
http://archive.ics.uci.edu/ml/datasets/image+segmentation
** MovieLens
https://grouplens.org/datasets/movielens/
GroupLens Research has collected and made available rating data sets from the MovieLens web site (http://movielens.org). The data sets were collected over various periods of time, depending on the size of the set. Before using these data sets, please review their README files for the usage licenses and other details.

Movie ratings and review datasets of various different sizes and scopes.
** spam assasin
http://spamassassin.apache.org/old/publiccorpus/
** fashion mnist
https://www.kaggle.com/zalando-research/fashionmnist
