ml-datasets.html
<div id="outline-container-org0c2f7f8" class="outline-3">
<h3 id="org0c2f7f8"><span class="section-number-3">1.28</span> Overhead Imagery Research Data Set</h3>
<div class="outline-text-3" id="text-1-28">
<p>
<a href="https://en.wikipedia.org/wiki/Overhead_Imagery_Research_Data_Set">https://en.wikipedia.org/wiki/Overhead_Imagery_Research_Data_Set</a>
</p>
</div>
</div>
<div id="outline-container-org470b32a" class="outline-3">
<h3 id="org470b32a"><span class="section-number-3">1.29</span> Image segmentation data set</h3>
<div class="outline-text-3" id="text-1-29">
<p>
<a href="http://archive.ics.uci.edu/ml/datasets/image+segmentation">http://archive.ics.uci.edu/ml/datasets/image+segmentation</a>
</p>
</div>
</div>
<div id="outline-container-org2250681" class="outline-3">
<h3 id="org2250681"><span class="section-number-3">1.30</span> MovieLens</h3>
<div class="outline-text-3" id="text-1-30">
<p>
<a href="https://grouplens.org/datasets/movielens/">https://grouplens.org/datasets/movielens/</a>
GroupLens Research has collected and made available rating data sets from the MovieLens web site (<a href="http://movielens.org">http://movielens.org</a>). The data sets were collected over various periods of time, depending on the size of the set. Before using these data sets, please review their README files for the usage licenses and other details.
</p>

<p>
Movie ratings and review datasets of various different sizes and scopes.
</p>
</div>
</div>
<div id="outline-container-orgd313f07" class="outline-3">
<h3 id="orgd313f07"><span class="section-number-3">1.31</span> spam assasin</h3>
<div class="outline-text-3" id="text-1-31">
<p>
<a href="http://spamassassin.apache.org/old/publiccorpus/">http://spamassassin.apache.org/old/publiccorpus/</a>
</p>
</div>
</div>
<div id="outline-container-org6306de5" class="outline-3">
<h3 id="org6306de5"><span class="section-number-3">1.32</span> fashion mnist</h3>
<div class="outline-text-3" id="text-1-32">
<p>
<a href="https://www.kaggle.com/zalando-research/fashionmnist">https://www.kaggle.com/zalando-research/fashionmnist</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kynan Tan</p>
<p class="date">Created: 2018-05-15 Tue 11:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
